import Vue from "vue";
import VueI18n from "vue-i18n";

Vue.use(VueI18n);

export const i18n = new VueI18n({
  locale: "ru",
  fallbackLocale: "ru",
  messages: {
    ru: {
      mainTitle: "Создавай Приложения На Армянском",
      mainText:
        "Программа MIT App Inventor создана, чтобы научить тебя создавать мобильные Android-приложения. Будучи разработанной в США, программа переведена на армянский и теперь доступна для всех. На сайте ты найдешь подробные видео уроки, которые научат тебя работать с MIT App Inventor.",
      programmerTitle: "Нажми на кнопку и становись программистом!",
      programmerText:
        "Здесь ты найдёшь видеоуроки, из которых узнаешь, как создавать приложения в MIT App Inventor, даже если никогда этого не делал раньше: просто наведи курсор на видео, посмотри интро, а дальше все пойдет само собой. Отправляйся в мир кодов и шифров, создавай новое!"
    },
    arm: {
      mainTitle: "Ստեղծի՛ր հավելված հայերենով",
      mainText:
        "MIT App Inventor ծրագիրը թարգմանվել է հայերեն և հեշտությամբ կսովորեցնի քեզ մշակել բջջային Android հավելվածներ։ Մեր կայքէջում դու կգտնես ամեն ինչ՝ մանրամասն տեսադասեր և խորհուրդներ, որոնց միջոցով արագ կյուրացնես MIT App Inventor-ը։",
      programmerTitle: "Սեղմի՛ր կոճակը և դարձի՛ր ծրագրավորող։",
      programmerText:
        "Այստեղ դու կգտնես հոլովակներ, որոնք քեզ կպատմեն, թե ինչպես ստեղծել հավելվածներ MIT App Inventor-ում, նույնիսկ եթե նախկինում երբևէ նման բան չես արել՝ պարզապես ուղղիր նշիչը տեսանյութի վրա, նայիր նախաբանը, իսկ հետո ամեն ինչ ինքնըստինքյան կլինի։ Ուղևորվի՛ր կոդերի և գաղտնագրերի աշխարհ, ստեղծի՛ր նորը։"
    }
  }
});
